import random

morse_ru = {
    "а": " • -", "б": " - • • •", "в": " • - -", "г": " - - •", "д": " - • •", "е": " •", "ё": " • • - - •",
    "ж": " • • • -", "з": " - - • •", "и": " • •", "й": " • - - -", "к": " - • -", "л": " • - • •", "м": " - -",
    "н": " - •", "о": " - - -", "п": " • - - •", "р": " • - •", "с": " • • •", "т": "-", "у": " • • -",
    "ф": " • • - •", "х": " • • • •", "ц": " - • - • •", "ч": " • • • - •", "ш": " - - - -", "щ": " - - • -",
    "ъ": " • - - • - -", "ы": " - • - •", "ь": " - • • -", "э": " • • - • •", "ю": " • • - -", "я": " • - • -"
}

words = ['дом', 'мир', 'кот', 'нос', 'волк', 'сон', 'мяч', 'роза', 'мясо', 'полк', 'кедр', 'лира', 'день', 'рада',
         'звук', 'нить', 'тумба', 'муха', 'цвет', 'букс', 'чаша', 'труба', 'крик', 'спор', 'книга', 'дача', 'путь',
         'флот', 'кулик', 'рука', 'пола', 'песо', 'свет', 'черт', 'клуб', 'курс', 'мука', 'лесо', 'кольцо', 'закон',
         'звезда', 'булава', 'монах', 'рельс', 'свадьба', 'орех', 'утка', 'тень', 'рис', 'мир']


def ex_2():
    used_letter = {}
    test_list = {
        'data': [],
        'answer': []
    }

    word = random.choice(words)
    lock = ''
    for i in word:
        letter = morse_ru[i]
        lock += letter
        used_letter[i] = letter

    test_list['data'] = ['Агент 007, передавая важные сведения своему напарнику, закодировал сообщение придуманным '
                         'шифром. В сообщении присутствуют только буквы из приведенного фрагмента кодовой таблицы:',
                         used_letter, 'Определите, какое сообщение закодировано в строчке:', lock, 'В ответе запишите '
                         'последовательность букв без запятых и других знаков препинания.']
    test_list['answer'] = [word]

    return test_list


print(ex_2())
