import random

tests = [['наибольшее', ['НЕ (X <= 15) И (X < 20)'], 19],
         ['наименьшее', ['(X > 5) И (X <= 10)'], 6],
         ['наибольшее', ['НЕ (X < 3) И (X > 1)'], 3],
         ['наименьшее', ['(X >= 8) И (X < 15)'], 8],
         ['наибольшее', ['(X >= 10) И (X <= 20)'], 20],
         ['наименьшее', ['НЕ (X > 20) И (X != 10)'], 10],
         ['наибольшее', ['(X < 30) И (X >= 25)'], 29],
         ['наименьшее', ['НЕ (X <= 5) И (X > 3)'], 6],
         ['наибольшее', ['(X != 17) И (X >= 15)'], 16],
         ['наименьшее', ['НЕ (X > 11) И (X <= 10)'], 10],
         ['наибольшее', ['(X >= 0) И (X < 5)'], 4],
         ['наименьшее', ['(X > 7) И (X <= 15)'], 8],
         ['наибольшее', ['(X < 50) И (X >= 45)'], 49],
         ['наименьшее', ['НЕ (X < 2) И (X > 0)'], 2],
         ['наибольшее', ['(X > 100) И (X <= 105)'], 105],
         ['наименьшее', ['НЕ (X >= 12) И (X < 10)'], 9],
         ['наибольшее', ['(X != 25) И (X > 20)'], 24],
         ['наименьшее', ['(X >= 30) И (X < 35)'], 30],
         ['наибольшее', ['(X < 4) И (X >= 0)'], 3],
         ['наименьшее', ['НЕ (X <= 8) И (X > 5)'], 9],
         ['наибольшее', ['(X != 13) И (X >= 10)'], 12],
         ['наименьшее', ['(X > 17) И (X <= 20)'], 18],
         ['наибольшее', ['(X < 40) И (X >= 35)'], 39],
         ['наименьшее', ['(X != 30) И (X > 25)'], 26],
         ['наибольшее', ['(X >= 5) И (X < 10)'], 9],
         ['наименьшее', ['(X < 20) И (X >= 15)'], 15],
         ['наибольшее', ['(X != 7) И (X > 5)'], 6],
         ['наименьшее', ['(X > 3) И (X <= 8)'], 4],
         ['наибольшее', ['(X < 100) И (X >= 95)'], 99],
         ['наименьшее', ['(X != 40) И (X > 35)'], 36],
         ]


def ex_3():
    test_list = {
        'data': [],
        'answer': []
    }

    test = random.choice(tests)
    test_list['data'] = [f'Напишите {test[0]} целое число x, для которого истинно высказывание:', test[1]]
    test_list['answer'] = [test[2]]

    return test_list


print(ex_3())
